# Лабораторная №3
##  DHCPv4/v6 и SLAAC

### Цели задания


### Исходные данные

#### Создание сети и настройка основных параметров устройства
## 1. Установите схему адресации
Разбейте сеть на подсети 192.168.1.0/24, чтобы удовлетворить следующим требованиям:
    
   + «Подсеть A», поддерживающая 58 хостов (клиентская сеть на R1).
    
    Ближайшая подсеть удовлетворяющая условиям /26 содержащая до 62 хостов 

   + «Подсеть B», поддерживающая 28 хостов (управляющая сеть на R1).

    Ближайшая подсеть удовлетворяющая условиям /27 содержащая до 30 хостов

   + «Подсеть C», поддерживающая 12 хостов (клиентская сеть на R2).
  
    Ближайшая подсеть удовлетворяющая условиям /28 содержащая до 14 хостов

    |Подсеть  |Количество хостов        |Адрес сети     |Маска сети     |Обратная маска |Широковещательный адрес|
    |---------|-------------------------|---------------|---------------|---------------|-----------------------|              
    |Подсеть A|необходимо 58 доступно 62|192.168.1.0/26 |255.255.255.192|0.0.0.63       |192.168.1.63           |
    |Подсеть B|необходимо 28 доступно 30|192.168.1.64/27|255.255.255.224|0.0.0.31       |192.168.1.95           |
    |Подсеть C|необходимо 12 доступно 14|192.168.1.96/28|255.255.255.240|0.0.0.15       |192.168.1.111          |

## 2. Настройка базовых параметров
   + Присвойте имена устройствам в соответствии с топологией.
   ```
    (config)# hostname <X><n>
   ```
    где \<X> R - маршрутизатор S - коммутатор </br>
        \<n> номер устройства
   + Отключение поиска DNS
   ```
    (config)# no ip domain-lookup
   ```
    + Назначьте **class** в качестве зашифрованного пароля доступа к привилегированному режиму.
   ```
    (config)# enable secret class
   ```
   + Назначьте **cisco** в качестве паролей консоли и VTY
   ```
    (config)# line console 0
    (config-line)# password cisco
    (config-line)# login
   ```
   ```
    (config)# line vty 0 4
    (config-line)# password cisco
    (config-line)# login
   ```   
   + Включить шифрование паролей
   ```
    (config)# service password-encryption
   ```
   + Настройка баннерного сообщения дня (MOTD) для предупреждения пользователей о запрете несанкционированного доступа.
   ```
    (config)# banner motd "Unauthorized access denied"
   ```
   + Сохранение конфигурации
   ```
    #copy running-config startup-config
   ```
## 3. Настройка межвлановой маршрутизации на R1
   + Настраиваем саб-интерфейсы на R1
   ```
    R1(config)# interface g0/1.100
    R1(config-subif)# encapsulation dot1Q 100
    R1(config-subif)# description Clients   
    R1(config-subif)# ip address 192.168.1.1 255.255.255.192
    R1(config-subif)# exit
    R1(config)# interface g0/1.200
    R1(config-subif)# encapsulation dot1Q 200
    R1(config-subif)# description Management
    R1(config-subif)# ip address 192.168.1.62 255.255.255.224
    R1(config-subif)# exit
    R1(config)# interface g0/1.1000
    R1(config-subif)# encapsulation dot1Q 1000 native
    R1(config-subif)# description Native VLAN
    R1(config-subif)# exit
    R1(config)# interface g0/1
    R1(config-if)# no shutdown
   ```
## 4. Настройка интерфейса G0/1 на R2 и статической маршрутизации между R1 и R2 на интерфейсах G0/0
   + Настроим интерфейс G0/1 на R2
   ```
   R2(config)#interface g0/1
   R2(config-if)#description Clients R2
   R2(config-if)#ip address 192.168.1.97 255.255.255.240
   ```
   + Настройка интерфейсов G0/0 на маршрутизаторах R1 и R2
   ```
   R1(config)#interface g0/0
   R1(config-if)#description to_R2
   R1(config-if)#ip address 10.0.0.1 255.255.255.252
   R1(config-if)#no shutdown
   ```
   ```
   R2(config)#interface g0/0
   R2(config-if)#description to_R1
   R2(config-if)#ip address 10.0.0.2 255.255.255.252
   R2(config-if)#no shutdown
   ```
   + Настройка маршрутов по умолчанию на маршрутизаторах R1 и R2
   ```
   R1(config)#ip route 0.0.0.0 0.0.0.0 10.0.0.2
   ```
   ```
   R2(config)#ip route 0.0.0.0 0.0.0.0 10.0.0.1
   ```
   + Проверка статической маршрутизации между маршрутизаторами
   ![](./img/ping_r1tor2.png)
   